{
    "Error while saving Prefab": "GameObjectにアタッチされているスクリプトを確認してください。スクリプトが削除されている場合は、プレハブからそのスクリプトを削除するか、スクリプトを再追加してください。",
    "メモリ不足エラー": "Unityエディタの設定でメモリ使用量を減らすか、プロジェクト内のリソースを削減してください。",
    "NullReferenceException": "スクリプト内のオブジェクト参照がnullになっていないか確認してください。関連するGameObjectが正しく設定されているかチェックしてください。",
    "Clear Cache and PlayerPrefs": "別スクリプトで同じ名前の定義が使われている可能性がありますので確認してください。",
    "キャッシュとPlayerPrefsをクリアする": "別スクリプトで同じ名前の定義が使われている可能性がありますので確認してください。",
    "this avatar contains meshes that were imported with read/write disable. this must be fixed in the mesh import settings before uploading.": "fbxのインスペクター内にあるメッシュの「読み込み/書き込み有効」にチェックを入れる。",
    "The VRCSDK build was aborted at the request of the UdonSharpBuildCompile VRCSDKBuildRequestedCallback": "プロンプトのManage Projectで「VRChat-SDK -World」を入れなおしてください。また、エラーの出た.assetファイルを削除してください。",
    "Build target group Standalone is not supported": "Unityのインストールオプションで、必要なプラットフォーム（例: Standalone）を有効にしてください。また、Build Settingsで正しいターゲットプラットフォームが選択されているか確認してください。",
    "Assets folder is missing or inaccessible": "プロジェクトフォルダの構造を確認してください。`Assets`フォルダが存在すること、またその権限が適切に設定されていることを確認してください。",
    "DllNotFoundException": "必要なDLLがプロジェクトに含まれているか確認してください。また、プラットフォームに適したDLLを使用しているかチェックしてください。",
    "Shader compiler error": "使用しているShaderコードにエラーがないか確認してください。特定のプラットフォーム向けのShaderが問題を引き起こしている場合は、`#ifdef`ディレクティブを使用してプラットフォーム固有のコードを条件分岐してください。",
    "The type or namespace name '...' could not be found": "使用しているスクリプトやパッケージがプロジェクトに含まれているか確認してください。必要に応じて、`using`ディレクティブを追加して名前空間をインポートしてください。",
    "Invalid AABB aabb": "位置やスケールが極端に大きいオブジェクトがシーンに含まれていないか確認してください。問題がある場合は、適切な位置やスケールに修正してください。",
    "Android SDK is not set up correctly": "UnityのPreferencesでAndroid SDKパスが正しく設定されているか確認してください。必要であればUnity HubからAndroid Build Supportを再インストールしてください。",
    "Cannot resolve all project dependencies": "Unity Package Managerで依存関係が解決できない場合、エラーを引き起こしているパッケージを削除して再インポートしてください。",
    "Failed to load '...'. File not found": "指定されたファイルが存在しているか確認してください。ファイルのパスが正しいかもチェックしてください。",
    "Script execution order issue": "Unity Editorの「Script Execution Order」設定で、スクリプトの実行順序を正しく調整してください。",
    "No valid build targets found": "Build Settingsでターゲットプラットフォームが正しく設定されているか確認してください。また、ターゲットプラットフォーム用のビルドターゲットが有効になっているかも確認してください。",
    "The referenced script on this Behaviour is missing!": "スクリプトが削除されたか、名前が変更された可能性があります。該当するGameObjectのコンポーネントを再確認し、スクリプトを正しくリンクしてください。",
    "Could not load file or assembly": "依存しているアセンブリやDLLファイルが不足している場合があります。関連ファイルがプロジェクトに含まれているか、パスが正しいか確認してください。",
    "Assertion failed": "コード内で意図しない値が設定されている場合に発生します。該当する変数やパラメータの初期化を確認し、値が正しいか検証してください。",
    "Index out of range exception": "配列やリストのインデックスが範囲外の値になっている場合に発生します。インデックスが有効範囲内であることを確認してください。",
    "Scene is not loaded": "シーンが正しくロードされていない場合に発生します。シーンの読み込み処理を確認し、`SceneManager.LoadScene`が正しく呼び出されているか確認してください。",
    "OutOfMemoryException": "メモリ不足が原因で発生する場合があります。アプリケーションのメモリ使用量を減らすか、使用しているリソースを最適化してください。",
    "Access to the path is denied": "指定されたファイルパスにアクセス権がない場合に発生します。ファイルやディレクトリのアクセス権限を確認し、必要に応じて修正してください。",
    "Could not find method '...':": "スクリプト内のメソッド名が間違っている可能性があります。メソッド名や引数が正しく定義されているかを確認してください。",
    "Unable to find suitable desktop resolution": "ディスプレイ解像度が適切に設定されていない場合に発生します。解像度設定を調整することで解決できます。",
    "Error creating render texture": "レンダーテクスチャの作成に失敗した場合に発生します。リソースの使用状況や設定が正しいかを確認してください。",
    "Graphics API not supported": "選択したプラットフォームでGraphics APIがサポートされていない場合に発生します。Graphics APIの設定を見直してください。",
    "The operation could not be completed": "何らかの処理が完了できなかった場合に発生します。エラーメッセージに基づいて、詳細なログを確認し、原因を特定して対処してください。",
    "Input Axis not found": "設定した入力軸が見つからない場合に発生します。`InputManager`で設定された軸の名前を確認し、正しい名前が設定されていることを確認してください。",
    "Failed to initialize engine": "エンジンの初期化に失敗した場合に発生します。Unityのインストールが正しく行われているか、バージョンが適切であるかを確認してください。",
    "Texture compression is not supported": "使用しているプラットフォームでテクスチャ圧縮がサポートされていない場合に発生します。テクスチャの設定を変更し、圧縮方式を変更してください。",
    "Avatar descriptor missing": "アバターの`Avatar Descriptor`が欠落している場合、`VRChat SDK`でアバターの設定を追加する必要があります。",
    "Avatar rigging mismatch": "アバターのリギングがVRChatの要件と一致していない場合、`Humanoid`設定で再確認し、正しい骨構成を選択してください。",
    "Avatar performance is too high": "アバターのポリゴン数やシェーダーのパフォーマンスが高すぎる場合、パフォーマンスを最適化してください。`Mesh Simplifier`や`LOD`（Level of Detail）を使用することで改善できます。",
    "Too many materials on avatar": "アバターに使用されているマテリアルの数が多すぎる場合、マテリアルを統合してパフォーマンスを最適化してください。",
    "Failed to upload avatar": "アバターのアップロードに失敗した場合、Unityの`Console`ウィンドウで表示されるエラーメッセージを確認し、必要な修正を行ってください。VRChat SDKやネットワーク設定の確認も必要です。",
    "Texture size too large": "アバターに使用されているテクスチャのサイズが大きすぎる場合、テクスチャサイズを最適化してアップロードを再試行してください。",
    "Avatar file size too large": "アバターのファイルサイズが大きすぎる場合、アバターのメッシュやテクスチャを最適化して、サイズを縮小してください。",
    "Animation issue in avatar": "アバターにアニメーションが正しく設定されていない場合、アニメーションの設定を再確認し、必要に応じて修正してください。",
    "clearing blueprint ID": "アバターの「Pipeline Manager」コンポーネントを確認してください。「Detach(Optional)をするか、別アバターのBlueprint IDを「Attach(Optional)してください",
    "Avatar upload failed due to network error": "VRChatのサーバへの接続問題が発生している可能性があります。インターネット接続を確認し、再度アップロードを試みてください。",
    "BuilderException: Avatar validation failed": "アップロード時の検証に失敗 次のことを確認してください。「アバターのポリゴン数やボーン数が制限を超えていないか」「マテリアルが適切に設定されているか」「アニメーションが正しく設定されているか」「アバターの各部位が適切な階層構造になっているか」「VRChatSDKのバージョンが最新かどうか」「Unityのバージョンが適切かどうか」",
    "VRCSdkControlPanelAvatarBuilder.Build": "アップロード時の検証に失敗 次のことを確認してください。「アバターに必要なコンポーネントが欠けていたり、設定が間違っているか」「SDKとUnityのバージョンが一致しているか」「「VRChat SDK」パネルからアバターを検査して、エラーや警告がないか確認」「SDKのバージョンが古い」「ビルド対象のGameObjectが正しく参照されておらず、必要なアセットやスクリプトが不足している可能性があります。GameObjectの設定が正しいかを確認」",
    "Avatar validation failed": "アップロード時の検証に失敗 次のことを確認してください。「アバターのポリゴン数やボーン数が制限を超えていないか」「マテリアルが適切に設定されているか」「アニメーションが正しく設定されているか」「アバターの各部位が適切な階層構造になっているか」「VRChatSDKのバージョンが最新かどうか」「Unityのバージョンが適切かどうか」",
    "Error while saving Prefab: 'Assets/Zunkai1/Shinon/Prefab/Shinon.prefab'. You are trying to save a Prefab with a missing script. This is not allowed.Please change the script or remove it from the GameObject 'Hair'.": "GameObjectにアタッチされているスクリプトを確認してください。スクリプトが削除されている場合は、プレハブからそのスクリプトを削除するか、スクリプトを再追加してください。",
}
